Update GATEWAY_README.md
